#  Найти максимальный элемент среди минимальных элементов столбцов матрицы.

mat = [[16, 17, 18, 51],
       [4, 5, 6, 15],
       [7, 8, 9, 24],
       [13, 14, 15, 42],
       [1, 2, 3, 6],
       [10, 11, 12, 33]]

min = []
for i in range(4):
       result_mat = sorted(mat, key = lambda count: count[i])  # сортируем по i элементу
       min.append(result_mat[0][i])  # берем наименьший в i колонке

print("минимальные ",  min)
print("масимальное среди минимальных ", sorted(min)[-1])